TexasInstruments/c2000ware-core-sdk/driverlib/f28p55x/driverlib/cmpss.h
    HWREGH(base + CMPSS_O_CTRIPLFILCTL) = (HWREGH(base + CMPSS_O_CTRIPLFILCTL) &
                                           ~CMPSS_CTRIPLFILCTL_FILTINSEL_M)    |
                                          (uint16_t)filtInput;

    EDIS;
}

//*****************************************************************************
//
//! Gets the value of the internal DAC of the high comparator.
//!
//! \param base is the base address of the comparator module.
//!
//! This function gets the value of the internal DAC of the high comparator.
//! The value is read from the \e active register--not the shadow register to
//! which CMPSS_setDACValueHigh() writes.
//!
//! \return Returns the value driven by the internal DAC of the high comparator.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getDACValueHigh(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the DAC value to the DAC value shadow register.
    //
    return(HWREGH(base + CMPSS_O_DACHVALA));
}

//*****************************************************************************
//
//! Gets the value of the internal DAC of the low comparator.
//!
//! \param base is the base address of the comparator module.
//!
//! This function gets the value of the internal DAC of the low comparator.
//! The value is read from the \e active register--not the shadow register to
//! which CMPSS_setDACValueLow() writes.
//!
//! \return Returns the value driven by the internal DAC of the low comparator.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getDACValueLow(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the DAC value to the DAC value shadow register.
    //
    return(HWREGH(base + CMPSS_O_DACLVALA));
}

//*****************************************************************************
//
//! Causes a software reset of the high comparator digital filter output latch.
//!
//! \param base is the base address of the comparator module.
//!
//! This function causes a software reset of the high comparator digital filter
//! output latch. It will generate a single pulse of the latch reset signal.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_clearFilterLatchHigh(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Set the bit that generates a reset pulse to the digital filter latch.
    //
    EALLOW;

    HWREGH(base + CMPSS_O_COMPSTSCLR) |= CMPSS_COMPSTSCLR_HLATCHCLR;

    EDIS;
}

//*****************************************************************************
//
//! Causes a software reset of the low comparator digital filter output latch.
//!
//! \param base is the base address of the comparator module.
//!
//! This function causes a software reset of the low comparator digital filter
//! output latch. It will generate a single pulse of the latch reset signal.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_clearFilterLatchLow(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Set the bit that generates a reset pulse to the digital filter latch.
    //
    EALLOW;

    HWREGH(base + CMPSS_O_COMPSTSCLR) |= CMPSS_COMPSTSCLR_LLATCHCLR;

    EDIS;
}

//*****************************************************************************
//
//! Sets the ramp generator maximum reference value.
//!
//! \param base is the base address of the comparator module.
//! \param value the ramp maximum reference value.
//!
//! This function sets the ramp maximum reference value that will be loaded
//! into the ramp generator.
//!
//! \note This API returns the reference value for only the high ramp generator
//! and is to be deprecated in future. Use APIs \e CMPSS_getRampReferenceHigh()
//! and \e CMPSS_getRampReferenceLow() to get reference value for high and low
//! ramp generators respectively.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setMaxRampValue(uint32_t base,  uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the maximum ramp value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHREFS) = value;
}

//*****************************************************************************
//
//! Gets the ramp generator maximum reference value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API returns the reference value for only the high ramp generator
//! and is to be deprecated in future. Use APIs \e CMPSS_getRampReferenceHigh()
//! and \e CMPSS_getRampReferenceLow() to get reference value for high and low
//! ramp generators respectively.
//!
//! \return Returns the latched ramp maximum reference value that will be
//! loaded into the ramp generator.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getMaxRampValue(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the maximum ramp value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHREFA));
}

//*****************************************************************************
//
//! Sets the ramp generator decrement value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the ramp decrement value.
//!
//! This function sets the value that is subtracted from the ramp value on
//! every system clock cycle.
//!
//! \note This API configures the step value only for the high ramp generator
//! in down count mode and is to be deprecated in future. Use APIs
//! \e CMPSS_setRampStepHigh() and \e CMPSS_setRampStepLow() to configure the
//! step value for high and low ramp ramp generators respectively for up/down
//! count mode.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDecValue(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp decrement value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHSTEPVALS) = value;
}

//*****************************************************************************
//
//! Gets the ramp generator decrement value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API returns the high ramp generator step value only and is
//! to be deprecated in future. Use APIs \e CMPSS_getRampStepHigh() and
//! \e CMPSS_getRampStepLow() to configure the step value for high and
//! low ramp ramp generators respectively for up/down count mode.
//!
//! \return Returns the latched ramp decrement value that is subtracted from
//! the ramp value on every system clock cycle.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampDecValue(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the ramp decrement value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHSTEPVALA));
}

//*****************************************************************************
//
//! Sets the ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the 13-bit ramp delay value.
//!
//! This function sets the value that configures the number of system clock
//! cycles to delay the start of the ramp generator decrementer after a PWMSYNC
//! event is received. Delay value can be no greater than 8191.
//!
//! \note This API configures the delay value for only the high ramp generator
//! configured in down count mode and is to be deprecated in future. Use APIs
//! \e CMPSS_setRampDelayHigh() and \e CMPSS_setRampDelayLow() to configure
//! the delay value for high and low ramp generators respectively for up/down
//! count mode.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDelayValue(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(value < 8192U);

    //
    // Write the ramp delay value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHDLYS) = value;
}

//*****************************************************************************
//
//! Gets the ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API returns delay value for only the high ramp generator and
//! is to be deprecated in future. Use APIs \e CMPSS_getRampDelayHigh() and
//! \e CMPSS_getRampDelayLow() to configure the delay value for high and
//! low ramp ramp generators respectively for up/down count mode.
//!
//! \return Returns the latched ramp delay value that is subtracted from
//! the ramp value on every system clock cycle.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampDelayValue(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the ramp delay value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHDLYA));
}

//*****************************************************************************
//
//! Sets the ramp direction for the high ramp generator
//!
//! \param base is the base address of the comparator module.
//! \param dir is the ramp direction for high ramp generator.
//!
//! This function sets the ramp direction for the high ramp generator.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDirectionHigh(uint32_t base, CMPSS_RampDirection dir)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp direction value to the shadow register.
    //
    EALLOW;
    HWREGH(base + CMPSS_O_COMPDACHCTL) = (HWREGH(base + CMPSS_O_COMPDACHCTL) &
                                          ~(CMPSS_COMPDACHCTL_RAMPDIR)) |
                                          (uint16_t)dir;
    EDIS;
}

//*****************************************************************************
//
//! Sets the high ramp generator reference value.
//!
//! \param base is the base address of the comparator module.
//! \param value the high ramp generator reference value.
//!
//! This function sets the reference value that will be loaded into the high
//! ramp generator.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampReferenceHigh(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp reference value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHREFS) = value;
}

//*****************************************************************************
//
//! Gets the ramp generator  reference value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp reference value that will be loaded into
//! the high ramp generator.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampReferenceHigh(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the maximum ramp value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHREFA));
}

//*****************************************************************************
//
//! Sets the ramp generator decrement value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the ramp decrement value.
//!
//! This function sets the value that is subtracted from the ramp value on
//! every system clock cycle.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampStepHigh(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp step value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHSTEPVALS) = value;
}

//*****************************************************************************
//
//! Gets the ramp step value for high ramp generator.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp step value that is added/subtracted from
//! the ramp reference value on every system clock cycle.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampStepHigh(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the high ramp generator step value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHSTEPVALA));
}

//*****************************************************************************
//
//! Sets the high ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the 13-bit ramp delay value.
//!
//! This function sets the value that configures the number of system clock
//! cycles to delay the start of the ramp generator incrementor/decrementor
//! after a PWMSYNC event is received. Delay value can be no greater than 8191.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDelayHigh(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(value < 8192U);

    //
    // Write the ramp delay value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPHDLYS) = value;
}

//*****************************************************************************
//
//! Gets the high ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp delay value that configures the number
//! of system clock cycles to delay the start of the ramp generator incrementor/
//! decrementor after a PWMSYNC event is received.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampDelayHigh(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the ramp delay value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPHDLYA));
}

//*****************************************************************************
//
//! Sets the ramp direction for the low ramp generator
//!
//! \param base is the base address of the comparator module.
//! \param dir is the ramp direction for low ramp generator.
//!
//! This function sets the ramp direction for the low ramp generator.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDirectionLow(uint32_t base, CMPSS_RampDirection dir)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp direction value to the shadow register.
    //
    EALLOW;
    HWREGH(base + CMPSS_O_COMPDACLCTL) = (HWREGH(base + CMPSS_O_COMPDACLCTL) &
                                          ~(CMPSS_COMPDACLCTL_RAMPDIR)) |
                                          (uint16_t)dir;
    EDIS;
}

//*****************************************************************************
//
//! Sets the low ramp generator reference value.
//!
//! \param base is the base address of the comparator module.
//! \param value the low ramp generator reference value.
//!
//! This function sets the reference value that will be loaded into the low
//! ramp generator.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampReferenceLow(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp reference value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPLREFS) = value;
}

//*****************************************************************************
//
//! Gets the low ramp generator reference value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp reference value that will be loaded into
//! the low ramp generator.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampReferenceLow(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the ramp reference value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPLREFA));
}

//*****************************************************************************
//
//! Sets the ramp generator decrement value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the ramp decrement value.
//!
//! This function sets the value that is added/subtracted from the ramp value
//! on every system clock cycle.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampStepLow(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp step value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPLSTEPVALS) = value;
}

//*****************************************************************************
//
//! Gets the ramp step value for low ramp generator.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp step value that is added/subtracted from
//! the ramp reference value on every system clock cycle.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampStepLow(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the low ramp generator step value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPLSTEPVALA));
}

//*****************************************************************************
//
//! Sets the low ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//! \param value is the 13-bit ramp delay value.
//!
//! This function sets the value that configures the number of system clock
//! cycles to delay the start of the ramp generator incrementor/decrementor
//! after a PWMSYNC event is received. Delay value can be no greater than 8191.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_setRampDelayLow(uint32_t base, uint16_t value)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));
    ASSERT(value < 8192U);

    //
    // Write the ramp delay value to the shadow register.
    //
    HWREGH(base + CMPSS_O_RAMPLDLYS) = value;
}

//*****************************************************************************
//
//! Gets the low ramp generator delay value.
//!
//! \param base is the base address of the comparator module.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return Returns the latched ramp delay value that configures the number
//! of system clock cycles to delay the start of the ramp generator incrementor/
//! decrementor after a PWMSYNC event is received.
//
//*****************************************************************************
static inline uint16_t
CMPSS_getRampDelayLow(uint32_t base)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Read the ramp delay value from the register.
    //
    return(HWREGH(base + CMPSS_O_RAMPLDLYA));
}

//*****************************************************************************
//
//! Configures high ramp generator cross trigger feature
//!
//! \param base is the base address of the comparator module.
//! \param trigger is the desired cross trigger for ramp generation
//!
//! This function configures the cross trigger feature for the high ramp
//! generators. Cross triggering allows usage of both high and low ramp
//! generators in the CMPSS with the involvement of single PWM trigger. When
//! enabled, cross triggering allows selected PWMSYNCx signal to trigger start
//! of ramp(SOR) of primary ramp while secondary ramp can be triggered by the
//! end of ramp (EOR) of primary ramp generator.
//!
//! \note The primary ramp generator trigger can be configured through
//! CMPSS_configureSyncSourceHigh() API.
//!
//! \note This API is not valid for CMPSS-Lite IP.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_configureRampXTriggerHigh(uint32_t base, CMPSS_RampXTrigger trigger)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

    //
    // Write the ramp delay value to the shadow register.
    //
    EALLOW;
    HWREGH(base + CMPSS_O_COMPDACHCTL2) =
                                     (HWREGH(base + CMPSS_O_COMPDACHCTL2) &
                                      ~CMPSS_COMPDACHCTL2_XTRIGCFG_M)     |
                                     ((uint16_t)trigger <<
                                      CMPSS_COMPDACHCTL2_XTRIGCFG_S);
    EDIS;
}

//*****************************************************************************
//
//! Configures sync source for high comparator
//!
//! \param base is the base address of the comparator module.
//! \param syncSource is the desired EPWMxSYNCPER source
//!
//! This function configures desired EPWMxSYNCPER source for high comparator
//! blocks. Configured EPWMxSYNCPER signal can be used to synchronize loading
//! of DAC input value from shadow to active register. It can also be used to
//! synchronize Ramp generator, if applicable. Refer to device manual to check
//! if Ramp generator is available in the desired CMPSS instance.
//!
//! Valid values for \e syncSource parameter can be 1 to n, where n represents
//! the maximum number of EPWMSYNCPER signals available on the device. For
//! instance, passing 2 into \e syncSource will select EPWM2SYNCPER.
//!
//! \return None.
//
//*****************************************************************************
static inline void
CMPSS_configureSyncSourceHigh(uint32_t base, uint16_t syncSource)
{
    //
    // Check the arguments.
    //
    ASSERT(CMPSS_isBaseValid(base));

